# 调用
import restaurant

import restaurant

#--------------mian
def main():
    u = restaurant.login()
    while True:
        print("***********************51餐厅管理系统*************************")
        print("***********************1.查看菜单")
        print("***********************2.菜品上架")
        print("***********************3.菜品下架")
        print("***********************4.菜品更新")
        print("***********************5.点菜")
        print("***********************6.结账")
        print("***********************7.删除订单")
        print("***********************8.上菜")
        print("***********************9.订单统计")
        print("***********************10.退出")
        print("***********************************************************")
        c = int(input("请选择："))
        if c == 1:
            pass
        elif c == 2:
            pass
        elif c == 3:
            pass
        elif c == 4:
            pass
        elif c == 5:
            pass
        elif c == 6:
            pass
        elif c == 7:
            pass
        elif c == 8:
            pass
        elif c == 9:
            pass
        elif c == 10:
            pass
        else:
            print("***********************************************************")
            break

if __name__ == '__main__':
    main()